{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature-evidence report listing files and components involved in implementing manual task creation with energy-category selection.",
  "frontend-file-summaries.txt": "JSON-style text describing summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark themes, colors, and global styles.",
  "frontend/index.html": "Main HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Thin wrapper that renders FocusExecutionApp.",
  "frontend/src/components/AddTaskModal.tsx": "Modal for manually adding tasks with fields for title, why, energy category, steps, and estimated time.",
  "frontend/src/components/BrainDumpView.tsx": "Brain Dump tool that extracts tasks, classifies energy categories, supports editing, voice input, and adding items to backlog.",
  "frontend/src/components/EnergyCategorySelector.tsx": "UI component rendering selectable energy category cards using provided metadata.",
  "frontend/src/components/FocusHomeButton.tsx": "Button returning users to the main focus view.",
  "frontend/src/components/TaskEnergyAssistant.tsx": "A chat-style component that classifies user-described tasks into energy categories and displays assistant suggestions.",
  "frontend/src/FocusExecutionApp.jsx": "Main application managing tasks, energy state, views, timers, brain dump, and modal flows including AddTaskModal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for handling Internet Identity login, identity loading, and auth-client lifecycle management.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a browser speech‑to‑text hook using Web Speech API with listening state, error handling, and transcript management.",
  "frontend/src/index.css": "Defines global styles, fonts, Tailwind layers, color variables, and custom warm-themed utility classes and animations.",
  "frontend/src/lib/brainDumpTaskExtractor.ts": "Parses freeform text into discrete tasks using heuristics for bullets, lists, separators, and multi-part sentences.",
  "frontend/src/lib/taskEnergyClassifier.ts": "Implements a deterministic keyword- and pattern-based classifier that assigns an energy category to a task with confidence and explanation. Includes scoring logic using keywords, complexity, and time estimates.",
  "frontend/src/main.tsx": "Bootstraps the React application with React Query and an Internet Identity provider, rendering the main App component. Sets up the root element and global providers.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, shadows, animations, and container settings. Extends theme tokens and registers typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project's current state, architecture, features, and known issues for a React-based focus and task management system. Includes schema versioning and detailed notes on storage, UI, and AI-assisted task parsing."
}