{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing two Brain Dump–related features, their files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to brief functional descriptions for build planning.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and base element styling.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React app.",
  "frontend/src/App.tsx": "Single wrapper component that renders FocusExecutionApp.",
  "frontend/src/components/AddTaskModal.tsx": "Modal for manually adding tasks with fields for title, why, energy category, steps, and estimate.",
  "frontend/src/components/BrainDumpView.tsx": "Brain Dump interface that converts draft text to categorized items, supports speech-to-text, and syncs draft/items externally.",
  "frontend/src/components/EnergyCategorySelector.tsx": "Selector UI for choosing among four energy levels with icons and highlighting.",
  "frontend/src/components/FocusHomeButton.tsx": "Button that triggers a callback to return to the home focus view.",
  "frontend/src/components/TaskEnergyAssistant.tsx": "React UI component that collects a task description, classifies its energy category, and displays chat-style interactions with suggestions.",
  "frontend/src/FocusExecutionApp.jsx": "Main application component handling tasks, backlog, energy, Brain Dump storage, timers, and UI view logic.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, status tracking, and loading stored identities.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom hook wrapping browser speech recognition to provide transcript text, listening controls, and error handling.",
  "frontend/src/index.css": "Global Tailwind-based styles defining fonts, warm color variables, dark mode values, and utility animations.",
  "frontend/src/lib/brainDumpTaskExtractor.ts": "Local parser that extracts individual task strings from freeform text using rules for bullets, connectors, speech patterns, and task splitting.",
  "frontend/src/lib/taskEnergyClassifier.ts": "Implements a local keyword- and pattern-based classifier to assign tasks an energy category with confidence and explanation. Includes scoring logic based on keywords, complexity, and time estimates.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, extended colors, layout, animations, and plugins for typography and container queries.",
  "project_state.json": "Defines the project’s saved state, architecture notes, known issues, and existing features for the Focus & Execution Management System."
}