{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference during build planning.",
  "frontend/index.css": "Global Tailwind-based theme definitions including color vars, dark mode values, and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Simple wrapper that renders FocusExecutionApp.",
  "frontend/src/components/AddTaskModal.tsx": "Modal for creating tasks with fields for title, why, energy, steps, estimates, and planned timeline.",
  "frontend/src/components/BacklogTasksTable.tsx": "Table UI showing backlog tasks with energy, creation metadata, planned timeline, and completion time.",
  "frontend/src/components/BrainDumpItemsTable.tsx": "Renders a table of brain dump task items with energy labels, timestamps, and editable planned timelines.",
  "frontend/src/components/BrainDumpView.tsx": "Manages brain dump text input, speech-to-text, task extraction, energy classification, and toggling between views.",
  "frontend/src/components/EnergyCategorySelector.tsx": "Displays selectable energy category cards with icons, labels, and descriptions.",
  "frontend/src/components/FocusHomeButton.tsx": "Simple button component that triggers a return-to-focus action.",
  "frontend/src/components/StreakDetailsPanel.tsx": "Shows completed streak tasks with timestamps in a slide-up panel when open.",
  "frontend/src/components/TaskEnergyAssistant.tsx": "Chat-style assistant that analyzes task text and suggests an energy category.",
  "frontend/src/FocusExecutionApp.jsx": "Main application component handling tasks, energy selection, Brain Dump, metadata normalization, timer, and UI views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and state management.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides a React hook that manages browser speech recognition, tracking listening state, transcript, errors, and control methods.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, color variables, fonts, and animation utilities for the UI theme.",
  "frontend/src/lib/brainDumpTaskExtractor.ts": "Parses freeform text into individual task strings using rules for bullets, speech patterns, separators, and cleanup.",
  "frontend/src/lib/dateTimeFormat.ts": "Utility functions to format timestamps into readable date, time, and timeline strings.",
  "frontend/src/lib/streakCompletedTasksStorage.ts": "Handles loading, saving, and clearing streak-completed tasks in localStorage with validation.",
  "frontend/src/lib/taskEnergyClassifier.ts": "Classifies task text into energy categories using keyword scoring and complexity/time heuristics.",
  "frontend/src/lib/taskModels.ts": "Defines task-related TypeScript interfaces and normalization helpers for backlog tasks and brain dump items.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, components, and animations with extended OKLCH-based styling.",
  "project_state.json": "Defines the project’s versioned state, architecture notes, known issues, and existing feature records for a React-based focus/task management app. Captures storage models, UI requirements, Brain Dump behavior, and extension fields for tasks."
}