{
  "backend/main.mo": "Minimal Motoko canister declaring an empty actor.",
  "feature_evidence.json": "Feature evidence report describing two Brain Dump UI changes and their affected files and components.",
  "frontend-file-summaries.txt": "List of concise summaries for all frontend source files covering components, hooks, utilities, and styling.",
  "frontend/index.css": "Tailwind base and theme variables with light/dark palettes and global style application.",
  "frontend/index.html": "Main HTML entry point loading fonts and bootstrapping the React app.",
  "frontend/src/App.tsx": "Thin wrapper that renders the FocusExecutionApp component.",
  "frontend/src/components/BrainDumpView.tsx": "Brain Dump UI enabling text-to-task conversion, category suggestions, editing, and speech input.",
  "frontend/src/components/FocusHomeButton.tsx": "Button component that triggers returning to the Focus view.",
  "frontend/src/components/TaskEnergyAssistant.tsx": "Chat-style assistant that classifies tasks by energy category and supports applying suggestions.",
  "frontend/src/FocusExecutionApp.jsx": "Main application component handling task flow, energy state, timers, modals, and persistence.",
  "frontend/src/hooks/useActor.ts": "React hook for creating and updating a backend actor based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements a speech‑to‑text hook using the Web Speech API, handling recognition lifecycle, errors, and transcript state.",
  "frontend/src/index.css": "Defines global styles, fonts, Tailwind layers, warm color themes, dark mode variables, and custom animations and shadows.",
  "frontend/src/lib/brainDumpTaskExtractor.ts": "Extracts individual tasks from freeform text using heuristics for bullets, numbering, separators, and conjunctions.",
  "frontend/src/lib/taskEnergyClassifier.ts": "Classifies tasks into energy categories based on keyword matching, complexity, and time hints, returning a deterministic result.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, animations, custom OKLCH color system, shadows, container settings, and extended keyframes.",
  "project_state.json": "Defines the project’s current state, architecture notes, features, known issues, and metadata for a React-based focus/task management app."
}