{
  "kind": "build_request",
  "title": "Ensure Add Task supports manual entry with selectable energy categories",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Ensure the “Add Task” button flow allows users to manually create a task and explicitly choose its category (energy type) from the four existing categories (DEEP, STEADY, LOW, NONE), and that the selected category is saved on the task and reflected in backlog filtering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For add task button, ensure that i can add tasks manually and put them in various categories"
        ]
      },
      "acceptanceCriteria": [
        "From the Backlog view, the user can open the Add Task modal and manually enter a task title and other fields (without using Brain Dump).",
        "The Add Task modal provides a clear category/energy selector with the four existing energy categories (DEEP, STEADY, LOW, NONE).",
        "When the user selects a category and adds the task, the created task is persisted into the existing backlog storage and has its energy/category set to the selected value.",
        "The newly added task appears in the backlog list with its category indicated, and it is included/excluded appropriately when backlog energy filter chips are toggled.",
        "No user-facing text added or updated for this change uses non-English language."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the existing four-category energy model (DEEP, STEADY, LOW, NONE) unchanged."
  ],
  "nonGoals": [
    "Adding new categories beyond the existing four energy types.",
    "Adding backend persistence or server-side storage for tasks (this change remains client-side/local persistence).",
    "Introducing external AI/LLM calls for categorization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}