{
  "kind": "build_request",
  "title": "Add task timestamps, planned timelines, and completion times with table views in Backlog and Brain Dump",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Extend the client-side data models for Backlog tasks and Brain Dump items to include timestamp metadata: (1) creation date/time, (2) planned timeline for doing the task, and (3) completion time; ensure existing persisted data loads safely when these fields are missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "For all tasks in the backlog section, brain dump section create the following: Creation date, creation time, timelines for doing the task and time when task was completed in a table."
        ]
      },
      "acceptanceCriteria": [
        "Previously saved backlog tasks and brain dump items still load without errors after the change (missing new fields are handled gracefully).",
        "New Backlog tasks created via Add Task and via Brain Dump conversion have creation date/time stored automatically.",
        "Brain Dump items generated from draft text have creation date/time stored automatically.",
        "A planned timeline field exists in the data model for both Backlog tasks and Brain Dump items (it may be empty if not set).",
        "A completion timestamp field exists in the Backlog task model and is empty/null for incomplete tasks."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Capture and store creation date/time and planned timeline values when creating tasks (Add Task modal and Brain Dump -> Add to Backlog flow), and capture and store completion time when a task is completed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Creation date, creation time, timelines for doing the task and time when task was completed"
        ]
      },
      "acceptanceCriteria": [
        "When a user adds a task via the Add Task modal, the task includes a created-at timestamp and any planned timeline inputs (if provided).",
        "When a user converts Brain Dump text into items, each extracted Brain Dump item includes a created-at timestamp.",
        "When a user adds Brain Dump items to the Backlog, each created Backlog task includes a created-at timestamp (and carries over any planned timeline fields if they exist on the item).",
        "When a user completes the current task, the app records a completion timestamp for that task at completion time (even if the task is not kept in the backlog UI)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Update the Backlog section UI to display tasks in a table that includes columns for creation date, creation time, planned timeline, and completed time (blank/placeholder if not completed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...in the backlog section... time when task was completed in a table."
        ]
      },
      "acceptanceCriteria": [
        "Backlog view includes a table presentation for backlog tasks.",
        "Each row shows: Creation date, Creation time, Planned timeline, Completed time.",
        "For tasks that are not completed, Completed time displays a consistent placeholder (e.g., \"—\").",
        "Table styling matches the existing warm theme and remains readable on mobile (horizontal scroll or responsive stacking is acceptable)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Update the Brain Dump section UI to display extracted Brain Dump items in a table that includes columns for creation date, creation time, planned timeline, and completed time (blank/placeholder if not completed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...brain dump section... Creation date, creation time, timelines for doing the task and time when task was completed in a table."
        ]
      },
      "acceptanceCriteria": [
        "Brain Dump view includes a table presentation for extracted items (in addition to, or replacing, the current card/list layout) that lists one row per extracted item.",
        "Each row shows: Creation date, Creation time, Planned timeline, Completed time.",
        "For Brain Dump items that have no completion concept, Completed time displays a consistent placeholder (e.g., \"—\").",
        "Table styling matches the existing warm theme and remains readable on mobile (horizontal scroll or responsive stacking is acceptable)."
      ]
    }
  ],
  "constraints": [
    "Frontend: Do not modify any files under frontend/src/components/ui (read-only components must be composed, not edited).",
    "Frontend: Do not modify immutable hook/bootstrap paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend: Keep Motoko backend as a single-actor architecture; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add third-party calendar integrations, reminders, notifications, or email/SMS features.",
    "Do not add external databases or move persistence off localStorage.",
    "Do not change Internet Identity authentication behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}