{
  "kind": "build_request",
  "title": "Keep tasks created from Brain Dump after clearing/deleting the Brain Dump",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Ensure that clearing/deleting the Brain Dump (clearing the Brain Dump draft text and/or extracted Brain Dump items) never removes or alters tasks that have already been added to the main tasks backlog (stored under the existing 'tasks-backlog' key).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Now I want you to retain those tasks in the tasks list and not let them go once the brain dump is deleted. Tasks should remain."
        ]
      },
      "acceptanceCriteria": [
        "After using Brain Dump to extract items and clicking “Add All to Backlog” (or “Add Selected”), the newly created tasks appear in the Backlog view.",
        "Clicking “Clear All” in the Brain Dump view (or otherwise clearing the Brain Dump draft/items) does not remove any tasks from the Backlog.",
        "After clearing Brain Dump and reloading the page, tasks previously added from Brain Dump remain present in the Backlog (persisted via the existing 'tasks-backlog' storage key).",
        "Clearing Brain Dump only affects the Brain Dump storage keys ('brain-dump-draft' and 'brain-dump-items') and does not write an empty value into 'tasks-backlog'."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Add/adjust Brain Dump view helper text to clearly state that clearing the Brain Dump only clears the Brain Dump draft/items and that tasks already added to the backlog will remain.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Tasks should remain."
        ]
      },
      "acceptanceCriteria": [
        "Brain Dump UI displays clear English helper copy near the clear action indicating that clearing Brain Dump will not delete tasks already added to the backlog.",
        "Copy changes do not imply any external AI service (keep the existing “local” framing)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify the Internet Identity / actor hooks in frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not change Brain Dump extraction logic or energy categorization logic (they are working fine per the user).",
    "Do not introduce any backend persistence changes; backend/main.mo is currently a placeholder and this fix should remain frontend-only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}