{
  "kind": "build_request",
  "title": "Simplify Brain Dump: remove Energy Assistant button and focus on splitting brain-dump points into distinct tasks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Remove the Energy Assistant action/button from the Brain Dump view UI and replace it with a simple conversion action that only converts the Brain Dump draft text into multiple distinct task items (using the existing local deterministic extraction logic).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Brain dump i dont need energy assistant button but i need ai to look at brain dump points to convert them into individual distinct multiple tasks"
        ]
      },
      "acceptanceCriteria": [
        "In the Brain Dump view, there is no button labeled \"Energy Assistant\".",
        "The Brain Dump draft input section includes a single primary action with neutral wording such as \"Convert to Tasks\" (English user-facing text).",
        "Clicking the conversion action takes the current draft text and produces multiple individual Brain Dump items when the text contains common multi-task patterns (bullets, numbered lists, semicolons, or multi-clause sentences).",
        "The conversion continues to work fully offline and without any external AI/LLM calls."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update Brain Dump view helper copy to remove references to an “Energy Assistant” and describe the conversion behavior as splitting the brain dump into individual tasks (English user-facing text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Brain dump i dont need energy assistant button..."
        ]
      },
      "acceptanceCriteria": [
        "The Brain Dump description text no longer mentions \"Energy Assistant\".",
        "The updated helper text clearly tells the user that the app will split the brain dump into individual tasks (in English)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add any external AI/LLM API calls; keep Brain Dump parsing local and deterministic.",
    "Respect the existing warm, calming theme and existing Brain Dump layout patterns."
  ],
  "nonGoals": [
    "Do not add new backend (Motoko) APIs or persistence mechanisms for this change.",
    "Do not remove the Brain Dump feature itself, microphone input, or the ability to edit extracted items.",
    "Do not redesign energy categorization across the app beyond removing the Brain Dump “Energy Assistant” button and related copy."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}