{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Brain Dump: replace Energy Assistant with offline Convert to Tasks and update helper copy",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Remove the Energy Assistant action from Brain Dump and provide a single offline, deterministic “Convert to Tasks” action that splits draft text into multiple Brain Dump items.",
      "acceptanceCriteria": [
        "In the Brain Dump view, there is no button labeled \"Energy Assistant\".",
        "The Brain Dump draft input section includes a single primary action with neutral wording such as \"Convert to Tasks\" (English user-facing text).",
        "Clicking the conversion action takes the current draft text and produces multiple individual Brain Dump items when the text contains common multi-task patterns (bullets, numbered lists, semicolons, or multi-clause sentences).",
        "The conversion continues to work fully offline and without any external AI/LLM calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrainDumpView.tsx",
          "operation": "modify",
          "description": "Replace the draft action/button labeled \"Energy Assistant\" with a single primary action labeled \"Convert to Tasks\"; rename related handler(s) accordingly, ensure the action uses the existing local deterministic extraction logic (extractTasksFromBrainDump) to create multiple Brain Dump items from the current draft text, and ensure no external AI/LLM calls are introduced."
        },
        {
          "path": "frontend/src/lib/brainDumpTaskExtractor.ts",
          "operation": "modify",
          "description": "Refine/extend the deterministic splitting heuristics (still fully offline) to better handle common multi-task patterns called out in the requirement (e.g., multi-clause sentences and separators), while keeping the logic conservative to avoid over-splitting."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Update Brain Dump helper/description copy to remove Energy Assistant references and explain that the draft will be split into individual tasks.",
      "acceptanceCriteria": [
        "The Brain Dump description text no longer mentions \"Energy Assistant\".",
        "The updated helper text clearly tells the user that the app will split the brain dump into individual tasks (in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrainDumpView.tsx",
          "operation": "modify",
          "description": "Update the Brain Dump draft section helper/description text to remove references to an “Energy Assistant” and clearly describe the conversion behavior as splitting the brain dump into individual tasks (English user-facing text), preserving the existing warm, calming tone and layout patterns."
        }
      ]
    }
  ]
}