{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Manual Add Task with explicit energy category selection",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Enable manual task creation from Backlog with a 4-category energy selector, persist selected energy on the task, and ensure backlog list/filtering reflects it.",
      "acceptanceCriteria": [
        "From the Backlog view, the user can open the Add Task modal and manually enter a task title and other fields (without using Brain Dump).",
        "The Add Task modal provides a clear category/energy selector with the four existing energy categories (DEEP, STEADY, LOW, NONE).",
        "When the user selects a category and adds the task, the created task is persisted into the existing backlog storage and has its energy/category set to the selected value.",
        "The newly added task appears in the backlog list with its category indicated, and it is included/excluded appropriately when backlog energy filter chips are toggled.",
        "No user-facing text added or updated for this change uses non-English language."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddTaskModal.tsx",
          "operation": "create",
          "description": "Create a dedicated Add Task modal component for manual entry (title, why, steps, estimate) and an explicit energy selector limited to the existing 4 categories (DEEP, STEADY, LOW, NONE). Use shadcn-ui composed components (e.g., Dialog/Modal + Input/Textarea/Buttons/Select-like controls) to implement the modal UI without editing read-only UI sources. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/EnergyCategorySelector.tsx",
          "operation": "create",
          "description": "Add a small reusable selector UI for the four existing energy categories that can render as chips/buttons using provided energyLevels metadata (label/color/icon) and returns the selected key. Keep the energy model unchanged. Use shadcn-ui composed primitives as needed (e.g., ToggleGroup/Buttons) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/FocusExecutionApp.jsx",
          "operation": "modify",
          "description": "Wire the manual Add Task flow from the Backlog view to open the new AddTaskModal; ensure the modal passes the selected energy key through to the existing handleAddTask flow so tasks are saved with the chosen energy in local backlog persistence. Ensure backlog rows visibly indicate each task’s energy (using ENERGY_LEVELS metadata) and that the existing backlog energy filter chips continue to include/exclude newly created tasks based on task.energy."
        }
      ]
    }
  ]
}